{
  "homepage": {
    "heading1": "Full-stack Javascript/PHP web developer from France & Canada",
    "intro": "I enjoy learning by working on challenging projects. I write concise, legible & maintainable code.",
    "intro2": "I am specialized in Typescript and PHP applications, Docker and generative AI with 5+ years of experience."
  },
  "NavBar": {
    "home": "Home",
    "portfolio": "Portfolio",
    "contact-me": "Hire Me"
  },
  "TechStack": {
    "heading": "Technologies I know",
    "subHeading": "(Click logos to see details)",
    "favorites": "My favorites:",
    "others": "I am also experienced with:",
    "note": "VueJS & Nuxt are very similar to React & NextJS. Although I haven't worked with them directly in production, I am very familliar with the technologies and will easily adapt. I would love to learn more through some challenging projets.",
    "details": {
      "html": {
        "name": "HTML",
        "time": "5 years",
        "description": "I am very comfortable with it and I know how to use it to create responsive and accessible websites. I am also familiar with the latest HTML5 features. I am also familiar with the latest HTML5 features. I am also familiar with the latest HTML5 features. I am also familiar with the latest HTML5 features."
      },
      "css": {
        "name": "CSS",
        "time": "5 years",
        "description": "I am very comfortable with it and I know how to use it to create responsive and accessible websites."
      },
      "typescript": {
        "name": "Typescript",
        "time": "2 years",
        "description": "I have been using Typescript for 2 years now and I am very comfortable with it. I know how to use it to create scalable and maintainable applications."
      },
      "vuejs": {
        "name": "VueJS",
        "time": "1 year",
        "description": "I have been using VueJS for a year now and I am very comfortable with it. I know how to use it to create scalable and maintainable applications."
      },
      "nuxt": {
        "name": "Nuxt",
        "time": "1 year",
        "description": "I have been using Nuxt for a year now and I am very comfortable with it. I know how to use it to create scalable and maintainable applications."
      },
      "php": {
        "name": "PHP",
        "time": "2 years",
        "description": "I have been using PHP for 2 years now and I am very comfortable with it. I know how to use it to create scalable and maintainable applications."
      },
      "sql": {
        "name": "SQL",
        "time": "2 years",
        "description": "I have been using SQL for 2 years now and I am very comfortable with it. I know how to use it to create scalable and maintainable applications."
      },
      "docker": {
        "name": "Docker",
        "time": "1 year",
        "description": "I have been using Docker for a year now and I am very comfortable with it. I know how to use it to create scalable and maintainable applications."
      },
      "linux": {
        "name": "Linux",
        "time": "2 years",
        "description": "I have been using Linux for 2 years now and I am very comfortable with it. I know how to use it to create scalable and maintainable applications."
      },
      "nodejs": {
        "name": "NodeJS",
        "time": "2 years",
        "description": "I have been using NodeJS for 2 years now and I am very comfortable with it. I know how to use it to create scalable and maintainable applications."
      },
      "expressjs": {
        "name": "ExpressJS",
        "time": "2 years",
        "description": "I have been using ExpressJS for 2 years now and I am very comfortable with it. I know how to use it to create scalable and maintainable applications."
      },
      "python": {
        "name": "Python",
        "time": "1 year",
        "description": "I have been using Python for a year now and I am very comfortable with it. I know how to use it to create scalable and maintainable applications."
      },
      "llamaindex": {
        "name": "LlamaIndex",
        "time": "1 year",
        "description": "I have been using LlamaIndex for a year now and I am very comfortable with it. I know how to use it to create scalable and maintainable applications."
      },
      "wordpress": {
        "name": "Wordpress",
        "time": "1 year",
        "description": "I have been using Wordpress for a year now and I am very comfortable with it. I know how to use it to create scalable and maintainable applications."
      },
      "tailwind": {
        "name": "Tailwind",
        "time": "1 year",
        "description": "I have been using Tailwind for a year now and I am very comfortable with it. I know how to use it to create scalable and maintainable applications."
      },
      "bootstrap": {
        "name": "Bootstrap",
        "time": "1 year",
        "description": "I have been using Bootstrap for a year now and I am very comfortable with it. I know how to use it to create scalable and maintainable applications."
      }
    }
  },
  "PortfolioProjects": {
    "heading": "My Portfolio",
    "sub-heading": "Find out more about a few of my projects below:"
  },
  "ContactMe": {
    "heading": "Hire Me",
    "form-sub-heading": "Fill up the form",
    "contact-sub-heading": "Or contact me here",
    "email-address": "By e-mail:",
    "phone-number": "By phone:",
    "form": {
      "name": "Name:",
      "email": "E-mail:",
      "description": "Tell me about you:",
      "description-placeholder": "We are a looking for a full-stack web developer with 5y of experience...",
      "button": "Send",
      "response": {
        "name": "Please enter your name",
        "email": "Please enter your e-mail",
        "description": "Please enter a descrption",
        "success": "Thank you for contacting me, I will get back to you by e-mail very soon.",
        "failure": "There was an error while submitting the form, please contact me by e-mail or phone directly."
      }
    }
  },
  "ProjectPage": {
    "date-from": "From:",
    "date-to": "Until:",
    "visit": "Visit the website"
  }
}
